# 本次练习的所有答案均填写至print()的括号中打印出来
# 已知有一个列表
numbers = [2, 3, 1, 5, 7, 4, 4, 5, 4, 7, 7, 4, 10, 21, 15, 4, 4, 5, 6, 1, 4, 5, 40, 4, 23, 34, 112, 34, 52, 2, 4, 52,
           34, 4]

# 一、打印列表长度
print('---------------1------------------')
# 在中间空行处编写代码

# 在中间空行处编写代码

# 二、将上方列表内容分别按从大到小，从小到大进行排序后打印，但不能改变原列表(即当前问题第三句打印出的列表与给出的初始列表一致)
print('---------------2------------------')
# 在中间空行处编写代码


# 在中间空行处编写代码
print(numbers)

# 三、在数字3(索引1)后面插入数字666
print('---------------3------------------')
# 在中间空行处编写代码

# 在中间空行处编写代码
print(numbers)

# 四、打印数字112在列表中的索引
print('---------------4------------------')
# 在中间空行处编写代码

# 在中间空行处编写代码

# 五、不使用索引，将数字40删除
print('---------------5------------------')
# 在中间空行处编写代码

# 在中间空行处编写代码
print(numbers)

# 六、倒着打印列表
print('----------------6-----------------')
# 在中间空行处编写代码

# 在中间空行处编写代码

# 七、打印列表中的最大值和最小值
print('----------------7-----------------')
# 在中间编写代码


# 在中间编写代码
print('----------------end-----------------')
